In [2]:
import pandas as pd

# merge() â€” SQL-style joins (inner, left, right, outer)
    merge() combines two DataFrames using one or more columns like SQL joins. You choose how=:
    inner, left, right, outer.
    - syntax: pd.merge(df1, df2, on='key_column', how='inner/left/right/outer')
        (1) Inner Join:
         - Returns only the rows with keys that are present in both DataFrames.
        (2) Left Join:
         - Returns all rows from the left DataFrame and the matched rows from the
         right DataFrame.
         - Unmatched rows will have NaN for columns from the right DataFrame.
        (3) Right Join:
         - Returns all rows from the right DataFrame and the matched rows from the left DataFrame.
         - Unmatched rows will have NaN for columns from the left DataFrame.
        (4) Outer Join:
         - Returns all rows when there is a match in either left or right DataFrame.
         - Unmatched rows will have NaN for columns from the other DataFrame.

# Difference between merge() and join()
    - merge() is column-based and more flexible.
    - It behaves like SQL joins. Use on=, left_on=, right_on=. It handles many-to-one and
     many-to-many.
    - join() is index-based by default and is a method on DataFrame.
    - It is short and convenient when your keys are already indexes.
    - You can do df1.merge(df2, left_index=True, right_index=True) to get the same as df1.join
    (df2).
    - merge() has more options like validate=, indicator=, and fine control over suffixes.

In [3]:
customers = pd.DataFrame({
    'CustomerID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
})

orders = pd.DataFrame({
    'OrderID': [101, 102, 103, 104, 105],
    'CustomerID': [1, 2, 2, 5, 3],   # note CustomerID 5 does not exist in customers
    'Product': ['Laptop', 'Phone', 'Tablet', 'Monitor', 'Mouse'],
    'Amount': [1200, 800, 450, 300, 50]
})

In [4]:
# Inner join (only matching keys)
pd.merge(orders, customers, on='CustomerID', how='inner')
# Explanation: rows with CustomerID=5 were dropped because there is no matching customer.

   OrderID  CustomerID Product  Amount     Name         City
0      101           1  Laptop    1200    Alice     New York
1      102           2   Phone     800      Bob  Los Angeles
2      103           2  Tablet     450      Bob  Los Angeles
3      105           3   Mouse      50  Charlie      Chicago

In [5]:
# Left join (all left rows, match where possible)
# Left = keep all orders rows, add customer info if exists.
pd.merge(orders, customers, on='CustomerID', how='left')
# Explanation: OrderID 104 kept, but customer info is NaN because CustomerID=5 not in customers.

   OrderID  CustomerID  Product  Amount     Name         City
0      101           1   Laptop    1200    Alice     New York
1      102           2    Phone     800      Bob  Los Angeles
2      103           2   Tablet     450      Bob  Los Angeles
3      104           5  Monitor     300      NaN          NaN
4      105           3    Mouse      50  Charlie      Chicago

In [6]:
# Right join (all right rows, match where possible)
# Right = keep all customers rows, include order info if exists.
pd.merge(orders, customers, on='CustomerID', how='right')

# Explanation: Diana exists in customers but has no orders. Her order columns are NaN.

   OrderID  CustomerID Product  Amount     Name         City
0    101.0           1  Laptop  1200.0    Alice     New York
1    102.0           2   Phone   800.0      Bob  Los Angeles
2    103.0           2  Tablet   450.0      Bob  Los Angeles
3    105.0           3   Mouse    50.0  Charlie      Chicago
4      NaN           4     NaN     NaN    Diana      Houston

In [7]:
# Outer join (all rows from both sides)
pd.merge(orders, customers, on='CustomerID', how='outer')
# Explanation: includes both the unmatched order (CustomerID 5) and unmatched customer (CustomerID 4).

   OrderID  CustomerID  Product  Amount     Name         City
0    101.0           1   Laptop  1200.0    Alice     New York
1    102.0           2    Phone   800.0      Bob  Los Angeles
2    103.0           2   Tablet   450.0      Bob  Los Angeles
3    105.0           3    Mouse    50.0  Charlie      Chicago
4      NaN           4      NaN     NaN    Diana      Houston
5    104.0           5  Monitor   300.0      NaN          NaN

In [13]:
import pandas as pd
import numpy as np

# 1. Customers DataFrame
customers_data = {
    'CustomerID': range(101, 112),
    'CustomerName': ['Aarav Patel', 'Priya Sharma', 'Rohan Mehta', 'Sneha Desai', 'Vikram Singh', 'Anjali Gupta', 'Mohit Kumar', 'Isha Shah', 'Karan Joshi', 'Diya Verma', 'Jay Trivedi'],
    'Country': ['India', 'USA', 'India', 'UK', 'USA', 'Canada', 'India', 'Australia', 'UK', 'USA', 'India']
}
customers_df = pd.DataFrame(customers_data)

# 2. Products DataFrame
products_data = {
    'ProductID': range(201, 211),
    'ProductName': ['Laptop', 'Mouse', 'Keyboard', 'Monitor', 'Headphones', 'Webcam', 'USB Cable', 'Charger', 'Pen Drive', 'Hard Disk'],
    'Price': [75000, 800, 1200, 15000, 2500, 4000, 300, 900, 600, 5500]
}
products_df = pd.DataFrame(products_data)

# 3. Orders DataFrame
# Note: Customer 'Jay Trivedi' (111) has no orders to demonstrate left join later.
orders_data = {
    'OrderID': range(301, 316),
    'CustomerID': np.random.choice(range(101, 111), 15),
    'ProductID': np.random.choice(range(201, 211), 15),
    'Quantity': np.random.randint(1, 5, 15)
}
orders_df = pd.DataFrame(orders_data)

   ProductID ProductName  Price
0        201      Laptop  75000
1        202       Mouse    800
2        203    Keyboard   1200
3        204     Monitor  15000
4        205  Headphones   2500
5        206      Webcam   4000
6        207   USB Cable    300
7        208     Charger    900
8        209   Pen Drive    600
9        210   Hard Disk   5500

# ðŸ¤“ Easy Question
    (1) Show all order details along with the customer's name and country.

# ðŸ¤” Medium Questions
    (2) List all products along with their prices. If a product has never been ordered, it should still be included in the list.
    (3) For each order, show the customer's name, product name, and quantity.
    (4) List all customers and their corresponding order details. Customers who have not placed any orders should also be included in the final list.

In [ ]:
# 2. List all products along with their prices. If a product has never been ordered, it should still be included in the list.

In [ ]:
# 3. For each order, show the customer's name, product name, and quantity.

In [ ]:
# 4. List all customers and their corresponding order details. Customers who have not placed any orders should also be included in the final list.

# ðŸ¤¯ Hard Questions
    (5) Calculate the total revenue (Price * Quantity) for each product and display it alongside the product name.
    (6) Find the details (OrderID, CustomerName, ProductName, Quantity) for all orders placed by customers from the USA.
    (7) Find the customer who has spent the most money. Display their name and the total amount they have spent.

In [39]:
# 5. Calculate the total revenue (Price * Quantity) for each product and display it alongside the product name.
merge_data=pd.merge(products_df,orders_df,on="ProductID",how="inner")
merge_data['TotalRevenue']=merge_data['Price']*merge_data['Quantity']
merge_data.groupby(['ProductID','ProductName'])['TotalRevenue'].sum().reset_index()[['ProductName','TotalRevenue']]

  ProductName  TotalRevenue
0      Laptop        300000
1       Mouse          2400
2    Keyboard          3600
3     Monitor         45000
4   USB Cable          1500
5     Charger          4500
6   Pen Drive          4200
7   Hard Disk         27500

In [54]:
# 6. Find the details (OrderID, CustomerName, ProductName, Quantity) for all orders placed by customers from the USA.
'''
merge_data_order_customer=pd.merge(orders_df,customers_df,on="CustomerID",how='inner')
merge_data_order_customer_product=pd.merge(merge_data_order_customer,products_df,on="ProductID",how='inner')
merge_data_order_customer_product.loc[merge_data_order_customer_product['Country']=='USA',['OrderID','CustomerName','ProductName','Quantity']]


'''
final_result=(
    orders_df.merge(customers_df,on='CustomerID')
    .merge(products_df,on='ProductID')
    .query("Country =='USA'")
    [['OrderID','CustomerName','ProductName','Quantity']]
)
print(final_result)

   OrderID CustomerName ProductName  Quantity
7      308   Diya Verma       Mouse         1

In [68]:
# 7. Find the customer who has spent the most money. Display their name and the total amount they have spent.
final_result=(
    customers_df.merge(orders_df,on='CustomerID')
    .merge(products_df,on='ProductID')
)
final_result['TotalSpent']=final_result['Price']*final_result['Quantity']
final_result=final_result.groupby(['CustomerID','CustomerName'])['TotalSpent'].sum()
print(f"Name = {final_result.idxmax()[1]} , Total amount = {final_result.max()}")

Name = Sneha Desai , Total amount = 310300